{"class_name": "Model", "keras_version": "1.2.1", "config": {"output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 40, 160, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block1_conv1", "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block1_conv2", "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "config": {"border_mode": "valid", "name": "block1_pool", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block2_conv1", "dim_ordering": "tf", "nb_filter": 128, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block2_conv2", "dim_ordering": "tf", "nb_filter": 128, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "config": {"border_mode": "valid", "name": "block2_pool", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block3_conv1", "dim_ordering": "tf", "nb_filter": 256, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block3_conv2", "dim_ordering": "tf", "nb_filter": 256, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block3_conv3", "dim_ordering": "tf", "nb_filter": 256, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "config": {"border_mode": "valid", "name": "block3_pool", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block4_conv1", "dim_ordering": "tf", "nb_filter": 512, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block4_conv2", "dim_ordering": "tf", "nb_filter": 512, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block4_conv3", "dim_ordering": "tf", "nb_filter": 512, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "config": {"border_mode": "valid", "name": "block4_pool", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block5_conv1", "dim_ordering": "tf", "nb_filter": 512, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block5_conv2", "dim_ordering": "tf", "nb_filter": 512, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "config": {"nb_col": 3, "bias": true, "nb_row": 3, "name": "block5_conv3", "dim_ordering": "tf", "nb_filter": 512, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool", "config": {"border_mode": "valid", "name": "block5_pool", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "fc", "config": {"input_dim": 2560, "output_dim": 1024, "name": "fc", "W_constraint": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "inbound_nodes": [[["fc", 0, 0]]], "name": "fc2", "config": {"input_dim": 1024, "output_dim": 2, "name": "fc2", "W_constraint": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0]]], "name": "predictions", "config": {"input_dim": 2, "output_dim": 1, "name": "predictions", "W_constraint": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear"}}], "name": "model_1"}}